# Fnac

---

In [1]:
import pandas as pd
import os
import glob

In [2]:
os.chdir("C:\Adrian - GDrive\Professionnel\Formation\Informatique - Digital\Data University\Projet certification\src\\fnac")

df_raw = pd.DataFrame(columns=[], index=[])

for file in glob.glob("*.csv"):
    #print(file)
    csv = pd.read_csv(file, sep=";", encoding='latin-1')
    df_raw = df_raw.append(csv, ignore_index=True)

df_raw.shape

(377, 41)

In [3]:
df_raw.columns

Index(['Numéro de facture', 'Type', 'Reference', 'TVA', 'Date de création',
       'Statut commande', 'Prix total (TTC)', 'Prix total frais de port (TTC)',
       'Commission (HT)', 'Commission (TTC)', 'Frais de gestion (HT)',
       'Frais de gestion (TTC)', 'Montant reversé au vendeur (TTC)',
       'Prix produit (TTC)', 'Frais de port produit (TTC)', 'Quantité',
       'Produits', 'SKUs', 'EAN', 'Commentaire interne', 'Mode d'envoi',
       'Téléphone', 'Nom livraison', 'Prénom livraison', 'Société livraison',
       'Adresse 1 de livraison', 'Adresse 2 de livraison',
       'Adresse 3 de livraison', 'Code postal de livraison',
       'Ville de livraison', 'Pays livraison', 'Nom facturation',
       'Prénom facturation', 'Société facturation', 'Adresse 1 de facturation',
       'Adresse 2 de facturation', 'Adresse 3 de facturation',
       'Code postal de facturation', 'Ville de facturation',
       'Pays facturation', 'Date de facturation'],
      dtype='object')

In [4]:
df = df_raw

In [5]:
df = df[df['Type'] == "Commande"]
df.shape

(346, 41)

In [6]:
df = df.drop(columns=["Numéro de facture", "Type", "Reference", "TVA", "Statut commande", "Prix total frais de port (TTC)", "Commission (HT)", "Commission (TTC)", "Frais de gestion (HT)", "Frais de gestion (TTC)", "Montant reversé au vendeur (TTC)", "Prix produit (TTC)", "Frais de port produit (TTC)", "Quantité", "Produits", "EAN", "Commentaire interne", "Mode d'envoi", "Téléphone", "Nom livraison", "Prénom livraison", "Société livraison", "Adresse 1 de livraison", "Adresse 2 de livraison", "Adresse 3 de livraison", "Code postal de livraison", "Ville de livraison", "Nom facturation", "Prénom facturation", "Société facturation", "Adresse 1 de facturation", "Adresse 2 de facturation", "Adresse 3 de facturation", "Code postal de facturation", "Ville de facturation", "Pays facturation", "Date de facturation"])

In [7]:
df.shape

(346, 4)

In [8]:
df.dtypes

Date de création     object
Prix total (TTC)    float64
SKUs                 object
Pays livraison       object
dtype: object

In [9]:
df.head()

  Date de création  Prix total (TTC)        SKUs Pays livraison
0       18/12/2018             14.90  RO20154336            FRA
1       20/12/2018             39.80  R200041391            FRA
2       21/12/2018             25.80  R300023439            FRA
3       29/12/2018             45.80  R200042407            FRA
4       02/01/2019             16.95  RO90075913            FRA

In [10]:
df["Date de création"] = pd.to_datetime(df["Date de création"], format='%d/%m/%Y')
df

    Date de création  Prix total (TTC)        SKUs Pays livraison
0         2018-12-18             14.90  RO20154336            FRA
1         2018-12-20             39.80  R200041391            FRA
2         2018-12-21             25.80  R300023439            FRA
3         2018-12-29             45.80  R200042407            FRA
4         2019-01-02             16.95  RO90075913            FRA
..               ...               ...         ...            ...
372       2019-08-10             29.80  RO80168074            FRA
373       2019-08-11             16.95  RO70274499            FRA
374       2019-08-12             45.80  R320068117            FRA
375       2019-08-20             35.80  R320107758            FRA
376       2019-08-26             55.50  R240134194            FRA

[346 rows x 4 columns]

In [11]:
os.chdir("C:\Adrian - GDrive\Professionnel\Formation\Informatique - Digital\Data University\Projet certification\src")
df_country = pd.read_csv("sql-pays.csv")
df_country

      Id  Code Alpha2 Alpha3             nom_fr_fr              nom_en_gb
0      1     4     AF    AFG           Afghanistan            Afghanistan
1      2     8     AL    ALB               Albanie                Albania
2      3    10     AQ    ATA           Antarctique             Antarctica
3      4    12     DZ    DZA               Algérie                Algeria
4      5    16     AS    ASM     Samoa Américaines         American Samoa
..   ...   ...    ...    ...                   ...                    ...
236  237   876     WF    WLF      Wallis et Futuna      Wallis and Futuna
237  238   882     WS    WSM                 Samoa                  Samoa
238  239   887     YE    YEM                 Yémen                  Yemen
239  240   891     CS    SCG  Serbie-et-Monténégro  Serbia and Montenegro
240  241   894     ZM    ZMB                Zambie                 Zambia

[241 rows x 6 columns]

In [12]:
df = df.merge(df_country, left_on='Pays livraison', right_on='Alpha3')
df.columns

Index(['Date de création', 'Prix total (TTC)', 'SKUs', 'Pays livraison', 'Id',
       'Code', 'Alpha2', 'Alpha3', 'nom_fr_fr', 'nom_en_gb'],
      dtype='object')

In [14]:
df = df.drop(columns=['Pays livraison', 'Id', 'Code', 'Alpha2', 'Alpha3', 'nom_fr_fr'])
df

    Date de création  Prix total (TTC)        SKUs nom_en_gb
0         2018-12-18             14.90  RO20154336    France
1         2018-12-20             39.80  R200041391    France
2         2018-12-21             25.80  R300023439    France
3         2018-12-29             45.80  R200042407    France
4         2019-01-02             16.95  RO90075913    France
..               ...               ...         ...       ...
341       2019-08-10             29.80  RO80168074    France
342       2019-08-11             16.95  RO70274499    France
343       2019-08-12             45.80  R320068117    France
344       2019-08-20             35.80  R320107758    France
345       2019-08-26             55.50  R240134194    France

[346 rows x 4 columns]

In [15]:
os.chdir("C:\Adrian - GDrive\Professionnel\Formation\Informatique - Digital\Data University\Projet certification\csv")

df.to_csv("1-fnac.csv", index=False)